### Import Numpy and Pandas Libraries

In [1]:
import numpy as np
import pandas as pd

# Q1. Read the '.csv' file into a data frame and display the first 5 rows.

In [ ]:
df = pd.read_csv('C:\\Users\PRANAVSAI\Desktop\pred\Forbes_Billionaire.csv')

In [30]:
df.head(10)

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology
5,6,AMANCIO ORTEGA,84.0,55.1,Spain,Zara,Fashion & Retail
6,7,MARK ZUCKERBERG,35.0,54.7,United States,Facebook,Technology
7,8,JIM WALTON,71.0,54.6,United States,Walmart,Fashion & Retail
8,9,ALICE WALTON,70.0,54.4,United States,Walmart,Fashion & Retail
9,10,ROB WALTON,75.0,54.1,United States,Walmart,Fashion & Retail

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2095 entries, 0 to 2094
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Rank        2095 non-null   int64
 1   Name        2095 non-null   object
 2   Age         2052 non-null   float64
 3   Net Worth   2095 non-null   float64
 4   Country     2095 non-null   object
 5   Source      2095 non-null   object
 6   Industries  2095 non-null   object
dtypes: float64(2), int64(1), object(4)
memory usage: 114.7+ KB

In [11]:
df.describe()

              Rank          Age    Net Worth
count  2095.000000  2052.000000  2095.000000
mean   1017.895465    64.178850     3.836516
std     583.180996    13.272036     6.644467
min       1.000000    22.000000     1.000000
25%     514.000000    55.000000     1.400000
50%    1001.000000    64.000000     2.100000
75%    1513.000000    74.000000     3.600000
max    1990.000000   101.000000   113.000000

In [15]:
nw=df["Net Worth"]

In [16]:
nw.sum()

8037.499999999999

In [17]:
nw.mean()

3.8365155131265065

In [18]:
country= df["Country"]

In [21]:
country.mode()

0    United States
dtype: object

In [22]:
country.unique()

array(['United States', 'France', 'Spain', 'Mexico', 'China', 'India',
       'Germany', 'Canada', 'Hong Kong', 'Italy', 'Brazil', 'Russia',
       'Japan', 'Austria', 'Czechia', 'South Korea', 'Indonesia',
       'Sweden', 'Thailand', 'Australia', 'United Kingdom', 'Netherlands',
       'Singapore', 'Ireland', 'Chile', 'New Zealand', 'Cyprus',
       'Malaysia', 'Colombia', 'Nigeria', 'Denmark', 'Switzerland',
       'Belgium', 'Israel', 'South Africa', 'Vietnam', 'Philippines',
       'Taiwan', 'Egypt', 'Norway', 'Georgia', 'Finland', 'Turkey',
       'Algeria', 'Peru', 'Portugal', 'Poland', 'Kazakhstan',
       'United Arab Emirates', 'Venezuela', 'Liechtenstein', 'Greece',
       'Argentina', 'Eswatini (Swaziland)', 'Ukraine', 'Lebanon',
       'Guernsey', 'Oman', 'Iceland', 'Macao', 'Monaco', 'Tanzania',
       'Slovakia', 'Angola', 'Nepal', 'Romania', 'Kuwait', 'Hungary',
       'Qatar', 'St. Kitts and Nevis', 'Zimbabwe', 'Morocco'],
      dtype=object)

In [23]:
country.nunique()

72

In [29]:
df["Net Worth"].sort_values().tail(5)

4     59.0
3     67.5
2     76.0
1     98.0
0    113.0
Name: Net Worth, dtype: float64

# Q2. Name the top 8 industries with maximum count of billionaires

In [32]:
df["Industries"].unique()

array(['Technology', 'Fashion & Retail', 'Finance & Investments',
       'Telecom', 'Media & Entertainment', 'Diversified', 'Energy',
       'Real Estate', 'Gambling & Casinos', 'Food & Beverage',
       'Automotive', 'Manufacturing', 'Metals & Mining', 'Service',
       'Healthcare', 'Logistics', 'Construction & Engineering', 'Sports'],
      dtype=object)

In [35]:
df.groupby('Industries')['Name'].nunique().sort_values(ascending = False).head(8)

Industries
Finance & Investments    298
Technology               241
Fashion & Retail         209
Manufacturing            198
Real Estate              196
Diversified              169
Food & Beverage          168
Healthcare               149
Name: Name, dtype: int64

# Q3. State the headcount of billionaires from these top 8 industries

# Q4. Compare the mean of net worth of billionaires from these top 8 industries.

In [37]:
df.groupby('Industries')['Net Worth'].mean().sort_values(ascending = False).head(8)

Industries
Technology               5.634440
Fashion & Retail         5.372727
Telecom                  4.941379
Gambling & Casinos       4.528571
Metals & Mining          4.193220
Energy                   4.067500
Media & Entertainment    3.994595
Food & Beverage          3.708333
Name: Net Worth, dtype: float64

# Q5. Compare the mean age of billionaires from these top 8 industries.

In [54]:
df.groupby('Industries')['Age'].mean().sort_values().head(8)

Industries
Technology               55.375527
Metals & Mining          60.913793
Healthcare               63.088435
Automotive               63.152174
Manufacturing            64.139896
Service                  64.317460
Telecom                  64.413793
Media & Entertainment    64.760563
Name: Age, dtype: float64

# Q6. Name the Richest billionaire in the Automotive sector

In [43]:
df[df['Industries']=="Automotive"].sort_values(by = 'Net Worth', ascending = False).head(5)

,Rank,Name,Age,Net Worth,Country,Source,Industries
30,31,ELON MUSK,48.0,24.6,United States,"Tesla, SpaceX",Automotive
53,54,SUSANNE KLATTEN,57.0,16.8,Germany,"BMW, pharmaceuticals",Automotive
95,96,LI SHUFU,56.0,12.4,China,automobiles,Automotive
98,98,STEFAN QUANDT,53.0,12.3,Germany,BMW,Automotive
165,165,LU ZHONGFANG,77.0,8.2,China,education,Automotive

# Q7. Name top 5 countries with maximum number of billionaires.

In [55]:
pd.DataFrame(df.groupby('Country')['Name'].nunique()).sort_values(by='Name',ascending=False).head(5)

               Name
Country
United States   614
China           387
Germany         107
India           102
Russia           99

# Q8. Name the richest Chinese billionaire and his net worth

In [56]:
df[df['Country']=='China'].sort_values(by='Net Worth',ascending=False).head(1)

    Rank     Name   Age  Net Worth Country      Source  Industries
16    17  JACK MA  55.0       38.8   China  e-commerce  Technology

# Q9. Name top 5 Industries with maximum number of Indian billionaires.

In [63]:
df[df['Country']=='India'].groupby('Industries')['Name'].nunique().sort_values(ascending=False).head(5)

Industries
Healthcare       17
Manufacturing    14
Diversified      13
Technology       11
Real Estate       8
Name: Name, dtype: int64

# Q10. Name all the Indian billionaires in global top 100 list.

In [64]:
top_100 = df.sort_values(by='Net Worth',ascending=False).head(100)
top_100

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology
...,...,...,...,...,...,...,...
95,96,LI SHUFU,56.0,12.4,China,automobiles,Automotive
96,96,HASSO PLATTNER & FAMILY,76.0,12.4,Germany,software,Technology
98,98,STEFAN QUANDT,53.0,12.3,Germany,BMW,Automotive
97,98,LIU YONGHAO & FAMILY,68.0,12.3,China,agribusiness,Service
99,100,KEN GRIFFIN,51.0,12.1,United States,hedge funds,Finance & Investments

In [66]:
top_100[top_100['Country']=='India']

,Rank,Name,Age,Net Worth,Country,Source,Industries
20,21,MUKESH AMBANI,62.0,36.8,India,"petrochemicals, oil & gas",Energy
77,78,RADHAKISHAN DAMANI & FAMILY,65.0,13.8,India,"retail, investments",Fashion & Retail

# Q11. Name all the billionaires in India who are younger than 50 years. Also state their mean net worth

In [47]:
IB=df[df['Country']=='India']

In [53]:
IB[IB['Age']<50]

,Rank,Name,Age,Net Worth,Country,Source,Industries
874,875,VIJAY SHEKHAR SHARMA,41.0,2.4,India,financial technology,Service
1196,1196,BYJU RAVEENDRAN,38.0,1.8,India,education technology,Technology
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1420,1415,RANJAN PAI,47.0,1.5,India,education,Service
1618,1613,SHAMSHEER VAYALIL,43.0,1.3,India,healthcare,Healthcare
1732,1730,SACHIN BANSAL,38.0,1.2,India,flipkart,Fashion & Retail
1742,1730,RADHA VEMBU,47.0,1.2,India,technology,Technology
1856,1851,BINNY BANSAL,37.0,1.1,India,flipkart,Technology
1867,1851,ACHARYA BALKRISHNA,47.0,1.1,India,consumer goods,Food & Beverage

# Q12. Name the Indian billionaires from real estate sector who are richer than 'DONALD TRUMP'.

In [ ]:
df[df['Name']=='DONALD TRUMP']

In [68]:
Indian_billionaires_realestate = IB[IB['Industries']=='Real Estate']
Indian_billionaires_realestate

,Rank,Name,Age,Net Worth,Country,Source,Industries
494,494,KUSHAL PAL SINGH,88.0,3.7,India,real estate,Real Estate
774,764,CHANDRU RAHEJA,79.0,2.7,India,real estate,Real Estate
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1253,1196,MANGAL PRABHAT LODHA,64.0,1.8,India,real estate,Real Estate
1395,1335,JITENDRA VIRWANI,54.0,1.6,India,real estate,Real Estate
1712,1613,NIRANJAN HIRANANDANI,70.0,1.3,India,real estate,Real Estate
1716,1613,SUBHASH RUNWAL,76.0,1.3,India,real estate,Real Estate
1983,1851,MOFATRAJ MUNOT,75.0,1.1,India,real estate,Real Estate

# Q13. What is the total cumulative net worth of all the billionaires?

In [71]:
Indian_billionaires_realestate[Indian_billionaires_realestate['Net Worth']>df[df['Name']=='DONALD TRUMP'].values[0][3]]

     Rank              Name   Age  Net Worth Country       Source   Industries
494   494  KUSHAL PAL SINGH  88.0        3.7   India  real estate  Real Estate
774   764    CHANDRU RAHEJA  79.0        2.7   India  real estate  Real Estate

# END